Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/static-type-checking_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: static-type-checking title: Static Type Checking permalink: docs/static-type-checking.html ---
ja: --- id: static-type-checking title: 静的型チェック permalink: docs/static-type-checking.html ---

source: Static type checkers like [Flow](https://flow.org/) and [TypeScript](https://www.typescriptlang.org/) identify certain types of problems before you even run your code.
ja: [Flow](https://flow.org/) や [TypeScript](https://www.typescriptlang.org/) のような静的型チェッカーを使用することでコードを実行する前の早期段階に型不整合等の問題を検知することができます。

source: They can also improve developer workflow by adding features like auto-completion.
ja: 他にも型解析言語を使用することで補完などの機能が追加され、開発体験を上げることができます。

source: For this reason, we recommend using Flow or TypeScript instead of `PropTypes` for larger code bases.
ja: これらの理由から、大きいコードベースでは `PropTypes` の代わりに Flow や TypeScript を使うことをおすすめします。

source: [Flow](https://flow.org/) is a static type checker for your JavaScript code.
ja: [Flow](https://flow.org/) は JavaScript 用の静的型チェック機能です。

source: It is developed at Facebook and is often used with React.
ja: Facebook で開発されており、React と一緒に使われることが多いです。

source: It lets you annotate the variables, functions, and React components with a special type syntax, and catch mistakes early.
ja: 変数、関数や React コンポーネントに型を足すことができ、型不整合を早期に発見できるようになります。

source: You can read an [introduction to Flow](https://flow.org/en/docs/getting-started/) to learn its basics.
ja: [はじめての Flow](https://flow.org/en/docs/getting-started/) に基本情報が記載されているので、それを読むと良いでしょう。

source: To use Flow, you need to:
ja: Flow を使用するには以下の手順を踏みます：

source: * Add Flow to your project as a dependency.
ja: * Flow をプロジェクトの dependency に入れる。

source: * Ensure that Flow syntax is stripped from the compiled code.
ja: * Flow の型定義をコンパイル時にコードから剥がすように設定する。

source: * Add type annotations and run Flow to check them.
ja: * 型定義を追加し、Flow を起動して確認する。

source: We will explain these steps below in detail.
ja: 順を追って説明します。

source: ### Adding Flow to a Project {#adding-flow-to-a-project}
ja: ### Flow をプロジェクトに追加する {#adding-flow-to-a-project}

source: First, navigate to your project directory in the terminal.
ja: まず、ターミナル上であなたのプロジェクトが含まれているディレクトリに入り、以下のコマンドを入力してください。

source: You will need to run the following command:
ja: [Yarn](https://yarnpkg.com/) を使っている場合：

source: If you use [Yarn](https://yarnpkg.com/), run:
ja: ```bash yarn add --dev flow-bin ```

source: ```bash yarn add --dev flow-bin ```
ja: [npm](https://www.npmjs.com/) を使っている場合：

source: If you use [npm](https://www.npmjs.com/), run:
ja: ```bash npm install --save-dev flow-bin ```

source: ```bash npm install --save-dev flow-bin ```
ja: このコマンドによって Flow の最新版をあなたのプロジェクトに入れることができます。

source: This command installs the latest version of Flow into your project.
ja: 次に、`package.json` の `"scripts"` に `flow` を追加しましょう。

source: Now, add `flow` to the `"scripts"` section of your `package.json` to be able to use this from the terminal:
ja: これで、ターミナルで Flow を実行できるようになります。

source: Finally, run one of the following commands:
ja: 最後に、以下のコマンドを実行します：

source: This command will create a Flow configuration file that you will need to commit.
ja: このコマンドで Flow の設定ファイルを生成することができます。この設定ファイルはバージョン管理しましょう。

source: ### Stripping Flow Syntax from the Compiled Code {#stripping-flow-syntax-from-the-compiled-code}
ja: ### Flow の型定義をコンパイル時にコードから剥がす {#stripping-flow-syntax-from-the-compiled-code}

source: Flow extends the JavaScript language with a special syntax for type annotations.
ja: Flow は JavaScript 言語を拡張し、型定義のための特殊な記法を使えるようにします。

source: However, browsers aren't aware of this syntax, so we need to make sure it doesn't end up in the compiled JavaScript bundle that is sent to the browser.
ja: しかし、ブラウザはその記法について知らない為、ブラウザに送信されるコンパイル後の JavaScript バンドルに含まれないようにしなければいけません。

source: The exact way to do this depends on the tools you use to compile JavaScript.
ja: 剥がす方法は使用している JavaScript のコンパイルツールによって変わってきます。

source: If your project was set up using [Create React App](https://github.com/facebookincubator/create-react-app), congratulations!
ja: もし、あなたのプロジェクトが [Create React App](https://github.com/facebookincubator/create-react-app) によって生成されている場合、おめでとうございます！

source: The Flow annotations are already being stripped by default so you don't need to do anything else in this step.
ja: 既にビルド時に Flow の型定義は剥がされる設定になっているため、このステップで何もする必要はありません。

source: >Note: > >These instructions are *not* for Create React App users.
ja: >補足: > >以下の手順は Create React App で React をセットアップしている方向けでは*ありません*。

source: Even though Create React App uses Babel under the hood, it is already configured to understand Flow.
ja: Create React App も内部で Babel を使用していますが、既に Flow を使えるように設定されています。

source: Only follow this step if you *don't* use Create React App.
ja: 以下の手順は Create React App を使って*いない*場合のみ実行してください。

source: If you manually configured Babel for your project, you will need to install a special preset for Flow.
ja: もし、あなたが手動で Babel の設定を行っていた場合、以下のコマンドで Flow 用の Babel プリセットをインストールする必要があります。

source: If you use Yarn, run:
ja: yarn を使っている場合：

source: If you use npm, run:
ja: npm を使っている場合：

source: Then add the `flow` preset to your [Babel configuration](https://babeljs.io/docs/usage/babelrc/).
ja: そして、`flow` のプリセットを [Babel の設定ファイル](https://babeljs.io/docs/usage/babelrc/) に追加してください。

source: For example, if you configure Babel through `.babelrc` file, it could look like this:
ja: 例えば、Babel の設定を `.babelrc` ファイルで行っている場合は以下のようになります。

source: This will let you use the Flow syntax in your code.
ja: これであなたのコードで Flow の型定義が使えるようになります。

source: >Note: > >Flow does not require the `react` preset, but they are often used together.
ja: >補足: > >Flow を使うためには必ず `react` のプリセットが必要というわけではありません。ただ、よく組み合わせて使われています。

source: Flow itself understands JSX syntax out of the box.
ja: Flow はそのままでも JSX のシンタックスを認識できます。

source: #### Other Build Setups {#other-build-setups}
ja: #### 他のビルド設定 {#other-build-setups}

source: If you don't use either Create React App or Babel, you can use [flow-remove-types](https://github.com/flowtype/flow-remove-types) to strip the type annotations.
ja: もし、Create React App も Babel も使用していない場合、[flow-remove-types](https://github.com/flowtype/flow-remove-types) を使って Flow の型定義を剥がすことができます。

source: ### Running Flow {#running-flow}
ja: ### Flow の実行 {#running-flow}

source: If you followed the instructions above, you should be able to run Flow for the first time.
ja: もし、今までの手順を踏んでいる場合、以下のコマンドで Flow が実行されます。

source: You should see a message like:
ja: 以下のようなメッセージが表示されます。

source: ### Adding Flow Type Annotations {#adding-flow-type-annotations}
ja: ### Flow の型定義の追記 {#adding-flow-type-annotations}

source: By default, Flow only checks the files that include this annotation:
ja: Flow の初期設定では、以下のコメントが含まれているファイルのみ型チェックを行います。

source: Typically it is placed at the top of a file.
ja: 上記コメントは基本的にファイルの頭に記載します。

source: Try adding it to some files in your project and run `yarn flow` or `npm run flow` to see if Flow already found any issues.
ja: あなたのプロジェクトのいくつかのファイルに足してみて、`yarn flow` や `npm run flow` を実行して Flow が何か問題を検知するかどうかを確認してみましょう。

source: There is also [an option](https://flow.org/en/docs/config/options/#toc-all-boolean) to force Flow to check *all* files regardless of the annotation.
ja: Flow の型チェックを、コメントが含まれているかにかかわらず*全て*のファイルに対してかける[設定](https://flow.org/en/docs/config/options/#toc-all-boolean)も存在します。

source: This can be too noisy for existing projects, but is reasonable for a new project if you want to fully type it with Flow.
ja: これは既存のプロジェクトに対してかけると確認箇所が大量に出てしまいますが、新規プロジェクトの立ち上げで全てのファイルに型を入れたい場合は合理的な選択でしょう。

source: Now you're all set!
ja: これで準備は整いました！

source: We recommend to check out the following resources to learn more about Flow:
ja: Flow についてより深く知りたい場合には以下の資料が役立つでしょう。

source: [TypeScript](https://www.typescriptlang.org/) is a programming language developed by Microsoft.
ja: [TypeScript](https://www.typescriptlang.org/) は Microsoft によって開発されたプログラミング言語です。

source: It is a typed superset of JavaScript, and includes its own compiler.
ja: 型を所有した JavaScript のスーパーセットで、独自のコンパイラを所持しています。

source: Being a typed language, TypeScript can catch errors and bugs at build time, long before your app goes live.
ja: TypeScript は型言語であるため、実行前のビルド時にエラーやバグを検知することができます。

source: You can learn more about using TypeScript with React [here](https://github.com/Microsoft/TypeScript-React-Starter#typescript-react-starter).
ja: React と TypeScript を組み合わせて使うことに関しては、[ここ](https://github.com/Microsoft/TypeScript-React-Starter#typescript-react-starter)にも詳しく記載されています。

source: To use TypeScript, you need to:
ja: TypeScript を使うためには以下のことを行います。

source: * Add TypeScript as a dependency to your project
ja: * TypeScript をプロジェクトの dependency に入れる。

source: * Configure the TypeScript compiler options
ja: * TypeScript のコンパイラの設定を行う。

source: * Use the right file extensions
ja: * TypeScript 用のファイル拡張子を使用する。

source: * Add definitions for libraries you use
ja: * 使用するライブラリの型定義をインストールする。

source: Let's go over these in detail.
ja: 順を追って説明します。

source: ### Using TypeScript with Create React App {#using-typescript-with-create-react-app}
ja: ### Create React App で TypeScript を使用する{#using-typescript-with-create-react-app}

source: Create React App supports TypeScript out of the box.
ja: Create React App には最初から TypeScript のサポートが含まれています。

source: To create a **new project** with TypeScript support, run:
ja: TypeScript サポートが含まれている**新規プロジェクト**を作成するには、以下のコマンドを実行します。

source: You can also add it to an **existing Create React App project**, [as documented here](https://facebook.github.io/create-react-app/docs/adding-typescript).
ja: [この資料に記載されているように、](https://facebook.github.io/create-react-app/docs/adding-typescript)**既存の Create React App のプロジェクト**にも TypeScript のサポートを追加することができます。

source: >Note: > >If you use Create React App, you can **skip the rest of this page**.
ja: >補足: > >もし、Create React App を使っている場合、**以下の記述は全て飛ばして大丈夫です**。

source: It describes the manual setup which doesn't apply to Create React App users.
ja: Create React App を使用していない場合のセットアップ手順について記載しています。

source: ### Adding TypeScript to a Project {#adding-typescript-to-a-project} It all begins with running one command in your terminal.
ja: ### TypeScript をプロジェクトに追加する {#adding-typescript-to-a-project} 全ては TypeScript をインストールするところから始まります。プロジェクトが入っているフォルダで以下のコマンドを入力してください。

source: Congrats!
ja: おめでとうございます！

source: You've installed the latest version of TypeScript into your project.
ja: これで最新の TypeScript があなたのプロジェクトにインストールされました。

source: Installing TypeScript gives us access to the `tsc` command.
ja: これによって、`tsc` コマンドが使えるようになります。

source: Before configuration, let's add `tsc` to the "scripts" section in our `package.json`:
ja: 設定をする前に、まずは `tsc` を `package.json` の `"scripts"` に追加しましょう。

source: ### Configuring the TypeScript Compiler {#configuring-the-typescript-compiler} The compiler is of no help to us until we tell it what to do.
ja: ### TypeScript コンパイラの設定 {#configuring-the-typescript-compiler} コンパイラはこちらから設定しないと無価値です。

source: In TypeScript, these rules are defined in a special file called `tsconfig.json`.
ja: TypeScript ではコンパイラの設定は `tsconfig.json` というファイルで定義します。

source: To generate this file:
ja: このファイルを生成するには以下のコマンドを実行してください。

source: Looking at the now generated `tsconfig.json`, you can see that there are many options you can use to configure the compiler.
ja: 新しく生成された `tsconfig.json` を見てみると、コンパイラ設定用の様々なオプションがあることがわかります。

source: For a detailed description of all the options, check [here](https://www.typescriptlang.org/docs/handbook/tsconfig-json.html).
ja: これら全てのオプションの詳細に関しては[こちら](https://www.typescriptlang.org/docs/handbook/tsconfig-json.html)を参照してください。

source: Of the many options, we'll look at `rootDir` and `outDir`.
ja: たくさんの設定の中から `rootDir` と `outDir` に注目します。

source: In its true fashion, the compiler will take in typescript files and generate javascript files.
ja: 本来、コンパイラは TypeScript のファイルから JavaScript のファイルを生成します。

source: However we don't want to get confused with our source files and the generated output.
ja: しかし、既存のソースコードと生成されたコードが混合してしまうことは避けるべきです。

source: We'll address this in two steps: * Firstly, let's arrange our project structure like this.
ja: 以上の問題を 2 つの手順によって対応します。* まず、プロジェクトの構成を以下のように変更しましょう。

source: We'll place all our source code in the `src` directory.
ja: 全てのソースコードを `src` ディレクトリに移動します。

source: * Next, we'll tell the compiler where our source code is and where the output should go.
ja: * 次に、`tsconfig.json` を編集してコンパイラにソースコードの場所と生成する場所を設定します。

source: Great!
ja: 素晴らしい！

source: Now when we run our build script the compiler will output the generated javascript to the `build` folder.
ja: これで `build` のスクリプトを実行した際、コンパイラが生成したコードは `build` ディレクトリに格納されます。

source: The [TypeScript React Starter](https://github.com/Microsoft/TypeScript-React-Starter/blob/master/tsconfig.json) provides a `tsconfig.json` with a good set of rules to get you started.
ja: 他の設定に関しては、[TypeScript React Starter](https://github.com/Microsoft/TypeScript-React-Starter/blob/master/tsconfig.json) に React プロジェクト始めるのにおすすめな `tsconfig.json` を提供しているので、そちらを参照してください。

source: Generally, you don't want to keep the generated javascript in your source control, so be sure to add the build folder to your `.gitignore`.
ja: 基本的に、生成された JavaScript のコードはバージョン管理するべきではありません。`build` フォルダは `.gitignore` に追記しましょう。

source: ### File extensions {#file-extensions} In React, you most likely write your components in a `.js` file.
ja: ### ファイル拡張子 {#file-extensions} React ではおそらくコンポーネントを `.js` ファイルに書いていたと思います。

source: In TypeScript we have 2 file extensions:
ja: TypeScript には 2 種類のファイル拡張子が存在します。

source: `.ts` is the default file extension while `.tsx` is a special extension used for files which contain `JSX`.
ja: `.ts` がデフォルトの拡張子で、`JSX` が含まれているファイルは `.tsx` を使います。

source: ### Running TypeScript {#running-typescript}
ja: ### TypeScript の実行 {#running-typescript}

source: If you followed the instructions above, you should be able to run TypeScript for the first time.
ja: 上記の手順を踏んでいれば、以下のコマンドで TypeScript を実行することができます。

source: If you see no output, it means that it completed successfully.
ja: 実行結果に何も表示されない場合は、正常に完了したと言うことです。

source: ### Type Definitions {#type-definitions} To be able to show errors and hints from other packages, the compiler relies on declaration files.
ja: ### 型宣言 {#type-definitions} 他のライブラリを使用している時の型エラーやヒントを表示させるために、コンパイラは型宣言ファイルを参照します。

source: A declaration file provides all the type information about a library.
ja: 型宣言ファイルにはそのライブラリが使用する全ての型の情報が含まれています。

source: This enables us to use javascript libraries like those on npm in our project.
ja: これを使うことによって、npm 等から取得した JavaScript のライブラリをそのまま使うことができます。

source: There are two main ways to get declarations for a library:
ja: ライブラリの型宣言ファイルを取得するには主に以下の 2 つの方法があります。

source: __Bundled__ - The library bundles its own declaration file.
ja: __Bundled__ - これはライブラリ自体が型宣言ファイルを所有している場合です。

source: This is great for us, since all we need to do is install the library, and we can use it right away.
ja: この場合、ライブラリをインストールするだけでそのまま使用することができます。

source: To check if a library has bundled types, look for an `index.d.ts` file in the project.
ja: ライブラリが型宣言ファイルを所有しているかどうか確認するには、プロジェクトに `index.d.ts` ファイルがあるかどうかを見ます。

source: Some libraries will have it specified in their `package.json` under the `typings` or `types` field.
ja: 一部のライブラリは `package.json` の `typings`、または `types` の下に型宣言ファイルのパスを指定しています。

source: __[DefinitelyTyped](https://github.com/DefinitelyTyped/DefinitelyTyped)__ - DefinitelyTyped is a huge repository of declarations for libraries that don't bundle a declaration file.
ja: __[DefinitelyTyped](https://github.com/DefinitelyTyped/DefinitelyTyped)__ - DefinitelyTyped には型宣言ファイルがバンドルされていない様々なライブラリのための型定義が用意されています。

source: The declarations are crowd-sourced and managed by Microsoft and open source contributors.
ja: これらの型定義はクラウドソースにより Microsoft とオープンソースのコントリビュータが管理しています。

source: React for example doesn't bundle its own declaration file. Instead we can get it from DefinitelyTyped.
ja: 例えば、React には型宣言ファイルが含まれておりませんが、DefinitelyTyped から取得することができます。

source: To do so enter this command in your terminal.
ja: 取得するにはターミナルに以下のコマンドを入力してください。

source: __Local Declarations__ Sometimes the package that you want to use doesn't bundle declarations nor is it available on DefinitelyTyped. In that case, we can have a local declaration file.
ja: __ローカル型定義__ もし、使用しているライブラリに型宣言ファイルが含まれておらず、DefinitelyTyped にも該当する型宣言ファイルがない場合、自前で型宣言ファイルを作成することができます。

source: To do this, create a `declarations.d.ts` file in the root of your source directory.
ja: それを行うには `declarations.d.ts` をソースディレクトリのルートに作成します。

source: A simple declaration could look like this:
ja: 型宣言は以下のように行なえます。

source: You are now ready to code!
ja: これでコードを書く準備は整いました！

source: We recommend to check out the following resources to learn more about TypeScript:
ja: TypeScript についてより深く知りたい場合には以下の資料が役立つでしょう。

source: [Kotlin](https://kotlinlang.org/) is a statically typed language developed by JetBrains.
ja: [Kotlin](https://kotlinlang.org/) は JetBrains により開発された静的型言語です。

source: Its target platforms include the JVM, Android, LLVM, and [JavaScript](https://kotlinlang.org/docs/reference/js-overview.html).
ja: JVM、Android、LLVM、や [JavaScript](https://kotlinlang.org/docs/reference/js-overview.html) といったプラットフォームを対象としています。

source: JetBrains develops and maintains several tools specifically for the React community: [React bindings](https://github.com/JetBrains/kotlin-wrappers) as well as [Create React Kotlin App](https://github.com/JetBrains/create-react-kotlin-app).
ja: JetBrains は [React bindings](https://github.com/JetBrains/kotlin-wrappers) や [Create React Kotlin App](https://github.com/JetBrains/create-react-kotlin-app) のような様々な React コミュニティの為のツールの開発、運営を行っています。

source: The latter helps you start building React apps with Kotlin with no build configuration.
ja: 後者は React アプリをビルド設定いらずで Kotlin で書き始めることができます。

source: ## Other Languages {#other-languages}
ja: ## 他の言語 {#other-languages}

source: Note there are other statically typed languages that compile to JavaScript and are thus React compatible.
ja: JavaScript にコンパイルされ、React にも活用できる静的型言語は他にも存在します。

source: For example, [F#/Fable](https://fable.io/) with [elmish-react](https://elmish.github.io/react).
ja: 例えば、[F#/Fable](https://fable.io/) と [elmish-react](https://elmish.github.io/react) の組み合わせです。

source: Check out their respective sites for more information, and feel free to add more statically typed languages that work with React to this page!
ja: 詳細はそれぞれのサイトを確認してください。他にも React を活用できる静的型言語があれば、ぜひこのページに追記してください！
